[
  {
    "id": "repradar",
    "title": "RepRadar",
    "tagline": "Track executive orders; Contact your representative; Stay informed",
    "shortDescription": "A comprehensive tool for tracking the most up-to-date executive orders and find contacts for your local representative.",
    "fullDescription": "RepRadar is a full-stack web application that helps citizens stay informed about the current state of affairs. Users can search for representatives by location, view the most recent executive orders, and get AI summarizations of those executive orders. Built with a focus on civic engagement, transparency, and user experience.",
    "motivation": "Inspired by the need for greater civic engagement and transparency in government, RepRadar makes it easy for everyday citizens to understand current executire orders and find representatives to contact",
    "projectPlan": "https://embed.figma.com/board/wzG4kiosKh0WlHoW9DrUKE/Rep-Radar-Planning?node-id=0-1&embed-host=share",
    "technologies": {
      "frontend": ["React", "Node.js", "Cypress"],
      "backend": ["Ruby on Rails", "RSpec"],
      "database": ["PostgreSQL"],
      "other":["5 Calls API", "Federal Register API", "Render"]
    },
    "features": [
      {
        "title": "Find your representatives",
        "description": "Instantly discover your local, state, and federal representatives with a simple zip code search"
      },
      {
        "title": "Track Executive Orders",
        "description": "Stay informed with real-time executive order updates and AI-generated summaries that translate policy into plain language"
      },
      {
        "title": "Personalized Political Insights",
        "description": "Connect government action to your community with representative profiles and accessible policy explanations"
      }
    ],
    "challenges": [
      {
        "challenge": "Integrating multiple government APIs with inconsistent data formats",
        "solution": "Built a data normalization layer (i.e. gateways, serializers, and models) to standardize information from different sources"
      },
      {
        "challenge": "Handling Both fetched data and database data",
        "solution": "Created endpoint parameter that dynamically changed if data was directly fetched from api or from the users saves in the database"
      },
      {
        "challenge": "Finding an API that provided up to date summaries of each executive order",
        "solution": "Adjusted our MVP to provide links to the official pdfs of executive orders and then updated this to use an AI scrapper to generate summaries"
      }
    ],
    "images": [
      {
        "src": "/img/project_screenshots/repradar.png",
        "alt": "homepage",
        "caption": "homepage"
      }
    ],
    "thumbnail": "/img/project_screenshots/repradar.png",
    "githubUrl": "https://github.com/RedRadar-WT-Team",
    "liveUrl": "https://frontend-9cax.onrender.com",
    "demoVideo": "",
    "status": "completed",
    "startDate": "2025-04",
    "endDate": "2025-04",
    "current": false,
    "featured": true,
    "priority": 3,
    "role": "Full-Stack Developer",
    "teamSize": 6,
    "tags": ["civic-tech", "full-stack", "API-integration", "data-visualization"],
    "metrics": {
      "users": "",
      "uptime": "",
      "apiCalls": ""
    }
  },
  {
    "id": "tracker",
    "title": "Tracker",
    "tagline": "Organize your job search, one connection at a time",
    "shortDescription": "A comprehensive job hunt tracking application for managing contacts, companies, and applications.",
    "fullDescription": "A full-stack job search management application designed to help users stay organized throughout their job hunt. Features include contact management, company tracking, application progress monitoring, and relationship mapping between contacts, companies, and applications. The app helps users maintain meaningful connections while keeping track of their entire job search pipeline.",
    "motivation": "After experiencing the chaos of managing hundreds of applications, contacts, and company research during my own job search, I wanted to create a centralized tool that connects all the pieces of the job hunt process.",
    "projectPlan": "",
    "technologies": {
      "frontend": ["React", "TypeScript", "Tailwind CSS", "Cypress"],
      "backend": [ "Ruby on Rails", "PostgreSQL", "RSpec", "CircleCI"],
      "database": [],
      "other": []
    },
    "features": [
      {
        "title": "Contact Hub",
        "description": "Maintain detailed profiles for each contact with timestamped interaction logs and personal notes to keep relationships warm"
      },
      {
        "title": "Company Intelligence",
        "description": "Track target companies with custom interest ratings, research findings, and culture notes to prioritize your outreach"
      },
      {
        "title": "Application Pipeline",
        "description": "Monitor every application from initial interest through offer stage with customizable workflow statuses that match your process"
      },
      {
        "title": "Relationship Mapping",
        "description": "Visualize connections between your contacts, their companies, and your applications to leverage your network strategically"
      },
      {
        "title": "Progress Dashboard",
        "description": "Get a bird's-eye view of your entire job search with interactive visualizations showing where each opportunity stands"
      }
    ],
    "challenges": [
      {
        "challenge": "Selecting and integrating a rich text editor that balanced functionality with simplicity",
        "solution": "Evaluated multiple libraries and implemented a lightweight rich text solution that provided essential formatting without overwhelming users or bloating the application"
      },
      {
        "challenge": "Managing pointer events in the rich text editor to prevent conflicts with drag-and-drop features",
        "solution": "Implemented strategic pointer-events CSS and event propagation controls to isolate editor interactions from surrounding UI elements"
      }
    ],
    "images": [
      {
        "src": "/img/project_screenshots/tracker.png",
        "alt": "homepage",
        "caption": "Homepage"
      },
      {
        "src": "/img/project_screenshots/tracker-dashboard.png",
        "alt": "dashboard",
        "caption": "Dashboard"
      } 
    ],
    "thumbnail": "/img/project_screenshots/tracker.png",
    "githubUrl-fe": "https://github.com/turingschool/tracker-crm-fe",
    "githubUrl-be": "https://github.com/turingschool/tracker-crm",
    "liveUrl": "https://tracker-crm-fe-38f7cf1aaca5.herokuapp.com/",
    "demoVideo": null,
    "status": "in-progress",
    "startDate": "2024-08",
    "endDate": "2025-06",
    "current": false,
    "featured": true,
    "priority": 2,
    "role": "Frontend Developer",
    "teamSize": 39,
    "tags": ["productivity", "full-stack", "data-visualization", "job-search"],
    "metrics": null
  },
  {
    "id": "portfolio",
    "title": "Personal Portfolio",
    "tagline": "Showcasing my work with modern web tech",
    "shortDescription": "This portfolio website built with Vue and modern web technologies.",
    "fullDescription": "A modern, responsive portfolio website showcasing my projects, skills, and experience. Built with Vue 3.5 and featuring server-side rendering, custom reusable components, a clean design system using CSS variables, and dynamic content loading. Demonstrates proficiency in modern web development practices and attention to detail.",
    "motivation": "To create a professional online presence that showcases both my technical skills and design sensibility.",
    "projectPlan": "",
    "technologies": {
      "frontend": ["Vue.js","TypeScript", "CSS"],
      "backend": [],
      "database": [],
      "other": []
    },
    "features": [
      {
        "title": "Optimized Performance",
        "description": "Server-side rendering implementation ensures fast initial page loads and improved search engine visibility"
      },
      {
        "title": "Mobile-First Design",
        "description": "Seamless experience across desktop, tablet, and mobile devices with fluid responsive layouts"
      },
      {
        "title": "Reusable Component Library",
        "description": "Custom-built Vue components including animated tickers, interactive cards, and modular UI elements"
      },
      {
        "title": "Content Management",
        "description": "JSON-driven architecture enables easy content updates without touching code"
      },
      {
        "title": "Consistent Design System",
        "description": "Centralized CSS variables create a cohesive visual language with maintainable theming"
      }
    ],
    "challenges": [
      {
        "challenge": "Making components SSR-compatible",
        "solution": "Used platform detection and conditional rendering" 
      },
      {
        "challenge": "Implementing complex CSS animations for radial menu navigation",
        "solution": "Studied existing CSS library examples and reverse-engineered the approach, adapting it to work with Vue's reactive system"
      },
      {
        "challenge": "Creating a fully dynamic, template-driven architecture",
        "solution": "Designed a JSON-based content system where all site data lives in configuration files, enabling complete content updates without code changes"
      },
      {
        "challenge": "Maintaining type safety across dynamic JSON content",
        "solution": "Created comprehensive TypeScript interfaces that validate data structure and provide autocomplete throughout the application"
      }
    ],
    "images": [
      {
        "src": "/img/project_screenshots/portfolio.png",
        "alt": "homepage",
        "caption": "homepage"
      }
    ],
    "thumbnail": "/img/project_screenshots/portfolio.png",
    "githubUrl": "https://github.com/elysableu/portfolio",
    "liveUrl": "https://elysableu.github.io/portfolio/",
    "demoVideo": null,
    "status": "in-progress",
    "startDate": "2024-12",
    "endDate": "2025-01",
    "current": true,
    "featured": false,
    "priority": 1,
    "role": "Designer & Developer",
    "teamSize": 1,
    "tags": ["frontend", "Vue", "web-design", "SSR"],
    "metrics": null
  },
  {
    "id": "sguild",
    "title": "SilverGuild",
    "tagline": "Your complete D&D toolkit, from character sheets to campaign management",
    "shortDescription": "A comprehensive D&D toolkit application starting with intelligent character sheet creation and management.",
    "fullDescription": "SilverGuild is a full-stack D&D companion application designed to streamline tabletop gaming for players and dungeon masters alike. Currently featuring an intuitive character sheet creator and manager, the app aims to become a complete toolkit with dice rolling, interactive dungeon maps, GM mode for campaign management, beginner-friendly tutorials, and toggleable tooltips for rules clarification. Built with a focus on reducing the barrier to entry for new players while providing powerful tools that experienced gamers need to manage complex campaigns.",
    "motivation": "To create an accessible, all-in-one platform that makes D&D more approachable for newcomers while providing the depth and tools that experienced players need to manage complex campaigns.",
    "projectPlan": "",
    "technologies": {
      "frontend": ["React", "TypeScript", "Next.js"],
      "backend": ["Ruby on Rails", "RSpec"],
      "database": ["PostgreSQL"],
      "other": ["D&D 5e API", "AWS"]
    },
    "features": [
      {
        "title": "Character Sheet Creator",
        "description": "Streamlined character creation with guided workflows that help both new and experienced players build D&D characters quickly and accurately"
      },
      {
        "title": "Character Management",
        "description": "Centralized hub for managing multiple characters with easy tracking of stats, inventory, and progression"
      },
      {
        "title": "Dice Roller (Planned)",
        "description": "Integrated dice rolling system with customizable options and roll history tracking"
      },
      {
        "title": "Dungeon Maps (Planned)",
        "description": "Interactive map builder and viewer for visualizing combat encounters and exploration"
      },
      {
        "title": "GM Mode (Planned)",
        "description": "Specialized tools for dungeon masters to manage campaigns, NPCs, and encounter tracking"
      },
      {
        "title": "Beginner Mode (Planned)",
        "description": "Simplified interface with contextual guidance and rule explanations for players new to D&D"
      },
      {
        "title": "Smart Tooltips (Planned)",
        "description": "Toggleable rule clarifications and mechanic explanations throughout the interface"
      }
    ],
    "challenges": [
      {
        "challenge": "Determining how to break down character creation into a logical, user-friendly workflow",
        "solution": "Used Miro for user journey mapping and database schema tools to visualize the relationships between character attributes, creating a step-by-step flow that mirrors the natural progression of character building"
      },
      {
        "challenge": "Preventing scope creep and avoiding overwhelm on a complex, multi-feature project",
        "solution": "Broke the MVP into smaller, achievable phases with clear milestones—completed Backend Phase 1 and currently working on Frontend Phase 1, allowing for iterative development and regular wins"
      }
    ],
    "images": [
      {
        "src": "/img/project_screenshots/silverguild.png",
        "alt": "homepage",
        "caption": "homepage"
      }
    ],
    "thumbnail": "",
    "githubUrl": "https://github.com/SilverGuild",
    "liveUrl": "",
    "demoVideo": null,
    "status": "in-progress",
    "startDate": "2024-04",
    "endDate": "",
    "current": true,
    "featured": false,
    "priority": 2,
    "role": "Founder & Full-Stack Developer",
    "teamSize": 1,
    "tags": ["full-stack", "gaming", "passion-project", "D&D", "toolkit"],
    "metrics": null
  }
]
